Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ཆོ་འཕྲུལ་ཆེན་པོའི་སྒྲོན་མ་སྟོན་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called display of the great miraculous lamp.”

source: གཏེར་མི་ཟད་པ་ལ་འཇུག་པའི་ཆོ་འཕྲུལ་སྟོན་པ་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called miraculous display for entering the inexhaustible treasury.

source: རིན་པོ་ཆེའི་མཛོད་སྡུད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called gathering the precious storehouse.

source: རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་མཛོད་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called storehouse of abiding in inconceivable liberation.

source: རི་མོ་ལ་མཐའ་ཡས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called infinite veneration.

source: དགེ་བ་འབྱོར་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called acquisition of virtue.

source: དགའ་བ་ཕུན་སུམ་ཚོགས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called replete with joy.

source: ཚུལ་གྱི་རྣམ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called engaging in the aspects of reality.

source: མེ་ལོང་གི་དཀྱིལ་འཁོར་མ་བསྒྲིབས་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called unobscured spherical mirror.

source: དྲན་པའི་ཕྱོགས་མི་ཟད་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called inexhaustible mindfulness.

source: སེམས་ཅན་ཐམས་ཅད་ངེས་པར་སྒྲོལ་བ་ཡིད་དུ་འོང་བ་ལ་འཇུག་པ་ཞེས་བྱ་བ་སྟེ།
en: There is the Dharma gateway called engaging in the pleasure of definitively liberating all sentient beings.

source: བཅུ་པོ་དེ་དག་ནི་ཆོ་འཕྲུལ་ཆེན་པོའི་སྒྲོན་མ་སྟོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called display of the great miraculous lamp.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Utter Joy made great offerings to the Bhagavān and uttered this verse:

source: ཀྱེ་མ་བཅོམ་ལྡན་སངས་རྒྱས་མི་བསྐྱོད་པ། །ཆོ་འཕྲུལ་ཆེན་པོའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས། །སེམས་ཅན་རྣམས་ཀྱི་ཤེས་པ་བསྐྱེད་དོན་དུ། །དེ་རིང་ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: “Ah! Immovable bhagavān Buddha, Tathāgata, king of great miracles, In order to generate awareness among all sentient beings, Today you have taught a myriad of doctrines.”

source: ཆོ་འཕྲུལ་ཆེན་པོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅྭ་ལྔ་པའོ།། །།
en: This concludes the fifteenth chapter, on the topic of great miracles.

source: ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called king of the magical manifestation for entry into the elaborate exposition of the hail of Dharma.”

source: ཐོག་ཏོག་གི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཞེས་བྱ་བ་དང་།
en: “There is the Dharma gateway called jewel-mine of hail.

source: ཐོག་ཏོག་གི་རྒྱ་མཚོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called ocean of hail.

source: ཐོག་ཏོག་གི་སྤྱོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the use of hail.

source: ཐོག་ཏོག་གི་སྨན་ཆེན་པོའི་མཛོད་བསྟན་པ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called teaching of the storehouse of the great medicine of hail.

source: ཐོག་ཏོག་གི་སྤྱིའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the universality of hail.

source: ཐོག་ཏོག་གི་བློ་གྲོས་མི་ཟད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king of the inexhaustible intellect of hail.

source: ཐོག་ཏོག་གི་སྙིང་པོ་མཆོག་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called supreme essence of hail.

source: ཐོག་ཏོག་གི་སྒྲོན་མའི་དེད་དཔོན་ཐོབ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་།
en: There is the Dharma gateway called king who has obtained the captaincy of the lamp of hail.

source: ཆོས་ཀྱི་ཕྱོགས་ཀྱི་མཚོན་ཆའི་མཆོག་ཅེས་བྱ་བ་དང་།
en: There is the Dharma gateway called supreme weapon on the side of Dharma.

source: ཐོག་ཏོག་ཟབ་མོའི་དུས་ཞེས་བྱ་བ་སྟེ།
en: There is the Dharma gateway called time of profound hail.

source: བཅུ་པོ་དེ་དག་ནི་ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called king of the magical manifestation of entry into the elaborate exposition of the hail of Dharma.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་མངོན་པར་སྒེག་མ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Manifest Beauty made offerings to the Bhagavān and uttered this verse:

source: ལྷ་ཆེན་ཆོས་ཀྱི་སྤྲིན་ལགས་ཏེ། །ཐོག་ཏོག་རྒྱལ་པོ་དེ་བཞིན་གཤེགས། །
en: “Great god, you are the cloud of Dharma And the Tathāgata, the king of hail.

source: དེ་བཞིན་གཤེགས་པས་ཉོན་མོངས་རྣམས། །སྣ་ཚོགས་པར་ནི་ཚར་ཡང་བཅད། །
en: The Tathāgata has eradicated All the various afflictions.

source: སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཉོན་མོངས་ཐིབས་པོར་རོལ་པ་མཛད། །
en: As medicine for all sentient beings, You sport within the jungle of the afflictions.”

source: ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་གྱི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་དྲུག་པའོ།། །།
en: This concludes the sixteenth chapter, on the topic of the elaborate exposition of the hail of Dharma.

source: ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་མཛོད་སྲུང་བ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called guarding the storehouse of entry into the vajra gnosis.”

source: རྩེ་བའི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called precious storehouse of play.

source: ཚུལ་རབ་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the utterly delightful manner.

source: ཚུལ་གྱི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the magical manifestation of the miraculous manner.

source: ངང་པ་འཕྱོས་པའི་གནས་ཀྱི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called way of abiding of the swan in flight.

source: ནམ་མཁའ་ལེགས་པར་བརྒྱན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of well-adorned space.

source: བུམ་པ་ཤིང་གི་མགོ་ཐོགས་ཅན་གྱི་སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the medicine produced from the top of the fruit of the kumbha tree.

source: རྒྱ་མཚོ་ཟབ་མོ་མི་འཁྲུགས་པ་ལྟ་བུའི་བློ་གྲོས་ལ་འཇུག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of engaging the intellect that is like an undisturbed deep ocean.

source: རབ་ཏུ་དུལ་བའི་གཟི་བརྗིད་སྟོབས་ཅན་གྱི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of seasons having the brilliant strength of consummate discipline.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་ཀྱི་མཐའ་ལ་མི་རྟོགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called the noncomprehension of the limit of the inconceivable abode.

source: བསྐལ་པ་ལ་ཁྱབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called extending through an eon.

source: བཅུ་པོ་དེ་དག་ནི་ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་མཛོད་སྲུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called guarding the storehouse of entry into the vajra gnosis.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ཡེ་ཤེས་ཕྲ་བ་ལ་དགའ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Delights in Subtle Gnosis made offerings to the Bhagavān and uttered this verse:

source: སངས་རྒྱས་མཛད་བྲལ་ཆ་དང་བྲལ། །
en: “The Buddha is free from activity and free from partition.

source: དེ་བཞིན་གཤེགས་པ་མ་སྐྱེས་ཀྱང་། །སྐྱེས་པ་ལྟ་བུར་སྟོན་མཛད་དེ། །ཡེ་ཤེས་རྡོ་རྗེ་རྣམ་མང་མངའ། །
en: Although the Tathāgata is uncreated, You produce the display of appearing as though created, And you possess many kinds of vajra gnosis.”

source: ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་བདུན་པའོ།། །།
en: This concludes the seventeenth chapter, on the topic of entering the vajra gnosis.

source: ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called king of the magical manifestation of engaging in inexhaustible enjoyments.”

source: བདུད་རྩིའི་བློ་གྲོས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called entering into the intellect of nectar.

source: བདེ་བས་ཚིམ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering into satisfaction through bliss.

source: དགའ་བ་ལ་མཁས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called skilled in being joyful.

source: སྡུག་ཅིང་རབ་ཏུ་དགའ་བ་ལ་མཁས་པ་ཞེས་བྱ་བའི་ཆོས་སྒོ་དང་།
en: There is the Dharma gateway called skilled in being beautiful and utterly joyful.

source: ཟབ་ཅིང་བརྟན་པའི་ཆུའི་རོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering into the taste of the water that is deep and constant.

source: སེམས་ཀྱི་བློ་གྲོས་ཀྱི་སྤྱོད་ཡུལ་གྱི་བདེ་བ་འདོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of desiring the bliss of the domain of mind’s intelligence.

source: བདེ་བ་མི་ཟད་ཅིང་གདོད་མ་ནས་དྲི་མ་མེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the bliss that is inexhaustible and primordially stainless.

source: ཐམས་ཅད་རབ་ཏུ་མགུ་ཞིང་རབ་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called king of being utterly elated and delighted with everything.

source: བཅུ་པོ་དེ་དག་ནི་ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten#18 are the Dharma gateways called king of the magical manifestationthat enters into the inexhaustible enjoyments.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་ལག་ན་སྦྲང་ཆང་ཐོགས་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Holds the Rains in Her Hands made offerings to the Bhagavān and uttered this verse:

source: མཚན་མ་མི་མངའ་དེ་བཞིན་གཤེགས། །གཟུང་དུ་མེད་ཅིང་རེག་ཏུ་མེད། །
en: “The Tathāgata possesses no characteristics, And he is without grasping and contact.

source: སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །གསང་བ་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: You teach these various secrets As medicine for all sentient beings.”

source: ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པ་རྣམ་པར་འཕྲུལ་བའི་རྒྱལ་པོའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅྭ་བརྒྱད་པའོ།། །།
en: This concludes the eighteenth chapter, on the topic of the king of the magical manifestation of entry into the inexhaustible enjoyments.

source: ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān, the complete and perfect Buddha, to explain the ten Dharma gateways called entry into the direct demonstration of the aspects of the correct path.”

source: ཕྲ་བ་རྒྱས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called aspect of subtle proliferation.

source: བརྟན་པའི་རྣམ་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called storehouse of the aspect of constancy.

source: དཔའ་བའི་སྟོབས་ཀྱིས་རྣམ་པར་རྒྱལ་བའི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called precious storehouse of complete victory through courageous strength.

source: ལྷ་ཐམས་ཅད་ཀྱི་གནས་ཤར་ཕྱོགས་སུ་བལྟས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in viewing the abode of all the gods in the eastern direction.

source: གཞུང་ལུགས་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called bringing all scriptural traditions to completion.

source: གཞུང་ལུགས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called not being obscured by all scriptural traditions.

source: ལམ་ཐམས་ཅད་ལ་རབ་ཏུ་མགུ་ཞིང་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called utterly delighting in and being elated by all paths.

source: ལམ་ངན་པར་ཞུགས་པ་ཐམས་ཅད་སྤངས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called aspect of abandoning engagement with all negative paths.

source: རྒྱ་མཚོའི་རྣམ་པ་རྟག་པའི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the constant tide of the ocean.

source: རྒྱ་མཚོའི་དུས་ངེས་པ་ལ་མངོན་པར་རྩེ་བའི། རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called precious storehouse of playing as the definite tide of the ocean.

source: བཅུ་པོ་དེ་དག་ནི་ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called entry into the manifest demonstration of the aspects of the correct path.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་རབ་ཏུ་དུལ་བ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Utterly Tamed made offerings to the Bhagavān and uttered this verse:

source: དམ་པའི་ཡང་དག་ལམ་བསྲུངས་པ། །སེར་སྣ་ལས་འདས་རྣམ་པར་དག །སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །ཆོས་རྣམས་སྣ་ཚོགས་ཡང་དག་སྟོན། །
en: “Guardian of the correct, sacred path, Completely pure, having transcended miserliness, You correctly teach these various dharmas As medicine for all sentient beings.”

source: ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་སྒོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་དགུ་པའོ།། །།
en: This concludes the nineteenth chapter, on the topic of the Dharma gateways of setting in motion the demonstration of the aspects of the correct path.

source: ཕྲ་ཞིང་ཟབ་མོ་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called entry into the subtle and profound topics of discourse.”

source: མཉམ་པ་དང་གྱ་གྱུ་ཅན་ཐམས་ཅད་ཀྱི་གླེང་གཞི་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called all direct and indirect topics of discourse.

source: རོ་བྲོ་བ་ཐམས་ཅད་ལ་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called utterly delighting in experiencing all tastes.

source: གཞུང་ལུགས་ལ་རྣམ་པར་རྩེ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of playing within all scriptural traditions.

source: རྒྱས་པར་འདོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of desiring extensiveness.

source: རྒྱས་པ་ལ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of delighting in extensiveness.

source: ལུས་ལ་རབ་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of utterly delighting in the body.

source: སྡུག་ཅིང་དང་བའི་སྤྱོད་ལམ་ལ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of delighting in the path of pleasing, joyful conduct.

source: འཕགས་པས་རབ་ཏུ་བརྒྱན་པའི་དུས་ཚོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of seasons adorned by the noble ones.

source: དྲི་མའི་སྙིང་པོ་དྲི་མ་མེད་པར་བྱེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of rendering stainless the essence of stains.

source: དམིགས་པའི་རྣལ་འབྱོར་གྱི་དགེ་བས་མངོན་པར་ཚིམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called consummate satisfaction through the virtue of the yoga of observation.

source: བཅུ་པོ་དེ་དག་ནི་ཕྲ་ཞིང་ཟབ་པའི་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called entering the subtle and profound topics of discourse.”

source: དེ་ནས་དེའི་ཚེ་ལྷ་མོ་མགྲིན་དབྱངས་སྙན་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a goddess named Sweet Voice made offerings to the Bhagavān and uttered this verse:

source: དཔའ་ཆེན་སེང་གེའི་སྒྲ་སྒྲོགས་པ། །དེ་བཞིན་གཤེགས་སྒྲ་བསམ་མི་ཁྱབ། །
en: “Proclaiming the great, glorious lion’s roar, The Tathāgata’s voice is inconceivable.

source: སེམས་ཅན་རྣམས་ལ་སྨན་སླད་དུ། །སེང་གེའི་སྒྲ་ནི་མངོན་པར་སྒྲོགས། །
en: You manifestly proclaim the lion’s roar As medicine for all sentient beings.”

source: ཕྲ་ཞིང་ཟབ་པའི་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་པའོ།། །།
en: This concludes the twentieth chapter, on the entry into the subtle and profound topics of discourse.

source: སེང་གེའི་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ། སེང་གེའི་རྣམ་པར་རྩེ་བ་བསམ་གྱིས་མི་ཁྱབ་པས་རྣམ་པར་རོལ་པར་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called observation of the lion’s play.”

source: རྗེས་སུ་བྱ་བར་དཀའ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called stainlessness that is difficult to replicate.

source: སྦྲང་མ་དང་བུང་བའི་མེ་ཏོག་གི་དྲི་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called fragrance of the flowers of the bees and the flies.

source: རིན་པོ་ཆེ་རྣམ་པར་བསྒྱིངས་པའི་བློ་གྲོས་ཀྱིས་རྣམ་པར་རྩེ་ཞིང་གཉིད་ཀྱིས་ནོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called sporting with the intellect of the majestic jewel and being overcome by sleep.

source: རིན་པོ་ཆེའི་ལྷུན་པོ་མངོན་པར་རབ་ཏུ་གཡོ་བའི་མཆོག་ཐོབ་པར་དཀའ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called the supremacy that is difficult to obtain, of the shimmering heap of jewels.

source: ཆུ་འབབ་པ་ལྟ་བུར་རྩེ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the waterfall-like play.

source: ས་ཀུན་ཏུ་རབ་ཏུ་གཡོ་བ་རྒྱ་ཆེར་རྩེ་བ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called observation of the play of the vast, utterly and completely quaking earth.

source: ལག་པ་གཡས་གཡོན་གྱི་མཐིལ་གསལ་བར་གཅོད་པ་ལྟ་བུར་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called play that is like distinguishing between the palms of the left and right hands.

source: ཉ་པོ་ཆེ་དག་གི་མཇུག་མ་མངོན་པར་རྩེ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called king of the play of the tails of the great fishes.

source: ཐོབ་པར་དཀའ་བ་དང་། རྟོགས་པར་དཀའ་བ་རབ་ཏུ་སྟོན་པ་ལ་མངོན་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called playing at the teaching that is difficult to obtain and difficult to comprehend.

source: རྒྱན་ཐམས་ཅད་ཀྱི་རྣམ་པ་ལ་རབ་ཏུ་དགའ་ཞིང་མངོན་པར་རྩེ་བ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called observing play and delighting in the aspects of all adornments.

source: བཅུ་པོ་དེ་དག་ནི་སེང་གེ་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called observation of the lion’s play.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་སེང་གེ་དཔའ་བོ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Lion Hero made offerings to the Bhagavān and then uttered this verse:

source: ཀྱེ་མ་བཅོམ་ལྡན་སངས་རྒྱས་དཔེ་མེད་པ། །ཡེ་ཤེས་དཔེ་མེད་དག་ལ་རབ་ཏུ་གནས། །
en: “Ah! The bhagavān Buddha is incomparable, Abiding in pure, incomparable gnosis.

source: སེམས་ཅན་རྣམས་ལ་བདེ་མང་མཛད་སླད་དུ། །ཐབས་ཀྱིས་སེང་གེའི་རྣམ་པར་རོལ་པ་མཛད། །
en: To bring an abundance of bliss to all sentient beings, You produce the lion’s display through skillful means.”

source: སེང་གེ་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་གཅིག་པའོ།། །།
en: This concludes the twenty-first chapter, on the topic of the observation of the lion’s play.

source: མཚམས་སྦྱར་བ་ལ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་པར་མཚམས་སྦྱར་བར་བཤད་དུ་གསོལ།
en: “I beseech the Bhagavān to explain the ten Dharma gateways called discourse on engaging in activities in harmony with the world that accumulate connections for rebirth.”

source: མཚམས་རྟག་པར་བྱ་བའི་རྒྱལ་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called entering the king of forever taking rebirth.

source: ཐབས་ཀྱིས་ཤིན་ཏུ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering tranquility through skillful means.

source: དད་པའི་སྦྲང་རྩི་འཇམ་པ་ཡང་དག་པར་རབ་ཏུ་གཟུང་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called correctly applying and upholding the sweet honey of faith.

source: སེང་གེ་རྣམ་པར་རྩེ་བ་མངོན་པར་འཕགས་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entry into the manifest superiority of the lion’s play.

source: རིམ་པ་སྟོན་པའི་དུས་དང་ཚོད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering the times of displaying the stages.

source: རིམ་པ་དང་རིམ་པ་མེད་པ་དང་། ཡུལ་དང་ཡུལ་མ་ཡིན་པར་འཇུག་པ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་། གདུལ་དཀའ་བ་དང་།
en: There is the Dharma gateway called king of skill in entry into stages, the absence of stages, realms, and nonrealms.

source: དམུ་རྒོད་ཐབས་ཀྱིས་གཟུད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called using skillful means to guide those who are rough and difficult to tame.

source: མདའ་ལྟར་མགྱོགས་པར་ལུས་ལ་དབལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called entering a body swiftly like an arrow.

source: མཆོད་པ་འདོད་པ་ཐམས་ཅད་འཐོབ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called initiating the attainment of all desirable offerings.

source: གནས་འོག་མའི་ལས་བྱེད་པའི་ཐབས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: There is the Dharma gateway called entry into the skillful means of performing the activities of the lower abodes.

source: བཅུ་པོ་དེ་དག་ནི་མཚམས་སྦྱོར་བ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡིན་ནོ། །
en: These ten are the Dharma gateways called discourse on engaging in activities in harmony with the world that accumulate connections for rebirth.”

source: དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་སྤྲིན་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: At that time, a devaputra named Cloud made offerings to the Bhagavān and uttered this verse:

source: ཀྱེ་མ་འོག་མའི་གནས་གཤེགས་པ། །བཅོམ་ལྡན་དཀའ་བ་མཛད་པ་ལགས། །
en: “Ah! Going to the lower abodes Is one of the difficult deeds of the Bhagavān.

source: ཉིད་ཀྱི་སྲས་ལ་སྨན་སླད་དུ། །ཐབས་ཀྱིས་སྐུ་ལ་གནས་ནས་ཀྱང་། །ཡོངས་སུ་མྱ་ངན་འདའ་བར་མཛད། །
en: To serve as medicine for all your children, You abide in a body through skillful means But proceed to attain parinirvāṇa.”

source: མཚམས་སྦྱར་བ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོའི་གླེང་གཞིའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་གཉིས་པའོ།། །།
en: This concludes the twenty-second chapter, on the topic of the discourse on engaging in activities in harmony with the world that accumulate connections for rebirth.

source: འཕགས་པ་སྤྲིན་ཆེན་པོའི་མདོ། །བམ་པོ་དྲུག་པ། སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ། མངོན་པར་རྩེ་བའི་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Great Cloud Essence said, “I beseech the Bhagavān to explain the ten Dharma gateways called entering the precious storehouse of play.”

source: ཉི་མ་འཆར་ཀའི་གཙུག་ཕུད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: “There is the Dharma gateway called topknot of the rising sun.

source: སྙིང་པོ་ལྔ་པ་ལ་རྒྱ་ཆེར་རྩེ་བར་མངོན་པར་རྒྱགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called pride in the vast play of the ancient essence.

source: ཡོན་ཏན་རིན་པོ་ཆེའི་མཛོད་མངོན་དུ་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called arising of the precious storehouse of virtuous qualities.

source: ཚུལ་གྱི་མཚམས་བཟང་པོས་མངོན་པར་རྩེ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in play through the excellent limit of conduct.

source: ཆུའི་དུས་ལ་ཞུགས་པའི་སྟོབས་མི་འཇིག་པར་བྱ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་དང་།
en: There is the Dharma gateway called engaging in rousing the indestructible strength of initiating the wet season.
